# Практика к уроку 2.2

## Тема

Переменные и типы данных в языке **C**.

---

## Цель

Закрепить работу с переменными и базовыми типами данных:

- `int`;
- `float`;
- `double`;
- `char`;
- объявление переменных;
- присваивание значений;
- изменение значений переменных;
- вывод значений через `printf`.

---

## Задание 1. Информация о пользователе

Напишите программу, которая хранит и выводит информацию о пользователе.

В программе должны быть переменные:

| Переменная | Тип | Что хранит |
|---|---|---|
| `age` | `int` | возраст |
| `height` | `double` | рост |
| `grade` | `char` | оценка |

Пример вывода:

```text
User information
Age: 18
Height: 175.500000
Grade: A
```

### Требования

- объявить переменные нужных типов;
- сразу задать переменным значения;
- вывести каждое значение через `printf`;
- использовать корректные форматные спецификаторы.

---

## Задание 2. Информация о товаре

Напишите программу, которая хранит информацию о товаре в магазине.

В программе должны быть переменные:

| Переменная | Тип | Что хранит |
|---|---|---|
| `product_count` | `int` | количество товара |
| `product_price` | `double` | цена товара |
| `product_category` | `char` | категория товара |

Пример вывода:

```text
Product information
Count: 12
Price: 149.990000
Category: B
```

### Требования

- использовать понятные имена переменных;
- использовать стиль `snake_case`;
- вывести все значения в консоль.

---

## Задание 3. Изменение значения переменной

Напишите программу, в которой создаётся переменная `score`.

Сначала переменная должна хранить значение `100`, затем значение должно измениться на `150`.

Пример вывода:

```text
Old score: 100
New score: 150
```

### Требования

- создать переменную `score` типа `int`;
- вывести начальное значение;
- изменить значение переменной;
- вывести новое значение.

---

## Задание 4. Исправление типов данных

Ниже приведена программа с ошибками в типах данных и выводе:

```c
#include <stdio.h>

int main(void)
{
    int temperature = 36.6;
    double age = 18;
    char grade = "A";

    printf("Temperature: %d\n", temperature);
    printf("Age: %lf\n", age);
    printf("Grade: %c\n", grade);

    return 0;
}
```

Исправьте программу так, чтобы она корректно хранила и выводила данные.

Ожидаемый результат:

```text
Temperature: 36.600000
Age: 18
Grade: A
```

### Требования

- подобрать подходящие типы данных;
- исправить кавычки для символа;
- исправить форматные спецификаторы в `printf`.

---

## Задание 5. Размеры типов данных

Напишите программу, которая выводит размер базовых типов данных с помощью `sizeof`.

Нужно вывести размеры типов:

- `char`;
- `int`;
- `float`;
- `double`.

Пример вывода:

```text
Size of char: 1
Size of int: 4
Size of float: 4
Size of double: 8
```

> Значения могут отличаться в зависимости от компилятора и системы.

### Требования

- использовать оператор `sizeof`;
- вывести размер каждого типа отдельной строкой;
- использовать спецификатор `%zu` для вывода результата `sizeof`.

---

## Что нужно сдать

В папку своего домашнего задания добавьте:

- исходный файл с решением задания 1;
- исходный файл с решением задания 2;
- исходный файл с решением задания 3;
- исходный файл с решением задания 4;
- исходный файл с решением задания 5;
- скриншот результата запуска каждой программы.

Рекомендуемые имена файлов:

```text
task_1.c
task_2.c
task_3.c
task_4.c
task_5.c
```

---

## Критерии выполнения

Задание зачтено, если:

- все пять программ запускаются без ошибок;
- переменные объявлены с подходящими типами данных;
- значения переменных выводятся корректно;
- используются понятные имена переменных;
- в заданиях используется корректный синтаксис C;
- результаты запуска подтверждены скриншотами.
