# Практика к уроку 2.1

## Тема

Структура программы на языке **C**.

---

## Цель

Закрепить базовую структуру программы на C:

- подключение библиотеки `stdio.h`;
- функцию `main`;
- фигурные скобки;
- инструкции;
- `printf`;
- `return 0`;
- точку с запятой.

---

## Задание 1. Вывод нескольких строк

Напишите программу, которая выводит в консоль три строки:

```text
Hello, C!
I am learning program structure.
This is lesson 2.1.
```

### Требования

- использовать `#include <stdio.h>`;
- использовать функцию `main`;
- каждую строку вывести отдельной командой `printf`;
- программа должна завершаться командой `return 0`.

---

## Задание 2. Исправление ошибок в программе

Ниже приведена программа с ошибками:

```c
#include <stdio.h>

int mian(void)
{
    printf("Program started\n")
    printf("Program finished\n");

    return 0;
```

Исправьте программу так, чтобы она компилировалась и выводила:

```text
Program started
Program finished
```

---

## Задание 3. Собственная программа

Напишите программу, которая выводит краткую информацию о вас.

Пример результата:

```text
Name: Ivan
Course: Programming Foundations
Language: C
Lesson: 2.1 Program structure
```

Можно заменить данные на свои.

### Требования

- программа должна содержать корректную структуру;
- должно быть не менее четырёх строк вывода;
- каждая строка должна выводиться через `printf`;
- в конце программы должна быть команда `return 0`.

---

## Что нужно сдать

В папку своего домашнего задания добавьте:

- исходный файл с решением задания 1;
- исходный файл с решением задания 2;
- исходный файл с решением задания 3;
- скриншот результата запуска каждой программы.

Рекомендуемые имена файлов:

```text
task_1.c
task_2.c
task_3.c
```

---

## Критерии выполнения

Задание зачтено, если:

- все три программы запускаются без ошибок;
- структура каждой программы оформлена корректно;
- используется `#include <stdio.h>`;
- используется функция `main`;
- инструкции заканчиваются точкой с запятой;
- результаты запуска подтверждены скриншотами.
